## Parcial No. 2 Bases de Datos  

    Universidad del Valle de Guatemala
    Bases de Datos
    Bidkar Pojoy
                                                                                            Jorge Eduardo Suchite Martinez
                                                                                             Carnet 15293
                                                                                             Mayo 30, de 2019

### Parte I Conceptos Teóricos 

Desarrolle / resuelva / conteste los siguientes enunciados

a)¿Qué es una base de datos?
b)Proceso de Normalización
c)¿Cuál es el objetivo principal de la Inteligencia de Negocios? ¿Cómo se relaciona este concepto con el concepto de DataWareHouse?

### a)  ¿Qué es una base de datos?

Una Base de datos surge con el fin de ayudar al almacenamiento de información en la cual todo dato está relacionado en un mismo contexto. Además, trata de que esta información sea lo más entendible posible y al igual que su extracción. 



Las bases de datos como tal, surgieron con el fin de almacenar información de ventas, compras y todo lo que se tuviera que tener registro de todo lo importante ya sea de información personal o de su información monetarioa. 


Todo con fines de negocio y comercialización en un mundo globalizado e interconectado.

Además, una base de datos está conformada por un:

Hardaware:  que sería uno o varios discos de estado solido de gran potencia
Software:  Es el servicio o plataforma de que se encarga del entorno de la base de datos en sí para que la información y
el usuario interactúe.


Administrador o Ingeniero en Ciencias de la Computación: es el encargado de velar por la integridad de la base de datos. (Parte importante puesto que es información valiosa para alguien la que está almacenada en ese lugar y tiene que ver alguien para que el usuario no cometa errores o se roben la información. s

### b) Proceso de Normalización

Sabemos que, en muchas de las compañias las bases de datos no están del todo correctas al momento de diseñarlas puesto que, en las épocas anteriores. Las personas solo necesitaban cierta información y solo la ponían y/o configuraban la db en base a que todo estuviera en una tabla. Lo cual no tenía ninguna conección o fluidez al momento de sacar información o se redundaba la información. o no se actualizaba en su totalidad al momento de insertar nueva información

Por esto mismo, se creo la normalización de una bases de datos en la cual se puede realizar una mejor práctica de creación de bases de datos y evitar lo antes mencionado. 

Entidad-Relación: se creo este concepto con el fin de que también se puedera ver qué recorrido hacía la información en la base de datos al igual que puede ser una forma gráfica de normalización.

Existen 4 niveles para realizar el proceso de Normalización. Pero por cuestiones de tiempo solo serán nombradas y no explicadas [F1N, F2N, F3N y F4N]

### c) ¿Cuál es el objetivo principal de la Inteligencia de Negocios? ¿Cómo se relaciona este concepto con el concepto de DataWareHouse?

1. A grandes rasgos es la forma, herramienta o medio en la cuál se obtienen datos o información de los procesos empresariales al igual de todo lo que conlleva las jerarquías y eslavones de la empresa (gestión empresarial) para poder  darles una interpretación o análisis  para poder optimizar ya sea un proceso o la rentabilidad de los servicios/productos que la empresa tiene o provee. 




2. El concepto de DataWareHouse es demasiado amplio, pero para fines de esta ocasión se resume en lo siguiente:
   
Se podría decir que un DataWareHouse s como un repositorio de Github en el cual está creado con el propósito de recabar información de diferentes fuentes de un negocio o de una empresa en este caso con el fin de optener análisis de cierto grupo de información y poer concluir o recomendar en base a estos resultados obtenidos por el DataWareHouse. 
   
Estaría relacionado puesto que con la inteligencia de negocios ya se sabe cómo debe de funcionar la empresa y un datawarehouse ayudaría a saber qué está pasando en la empresa ya sea en las transacciones que se hacen o en las quejas de los clientes ( si tiene call center). El datawarehouse ayudaría a la inteligencia de negocios a mostrarle los análisis e información que obtuvo y de qué decisiones podría tomar el encargado de tomar las decisiones en la empresa.

# Parte II del Parcial Consultas SQL 


En base al siguiente modelo relacional

cliente (id, nit, nombre, credito)
tienda (id, nombre, direccion)
compra (id, cliente_id, tienda_id, total, fecha)

Resuelvalos siguientes enunciados:

### a)Implemente el modelo relacional en SQLite. La base de datos debe de poseer datos de prueba y será utilizada por medio de Jupyter Notebooks  (10) Genere consulta SQL para generar / resolver 

### b)Nombres y créditos de clientes de los compradores de MAJADAS ordenado por crédito descendente y nombre ascendente.

### c)Agregar en el resultado anterior el crédito en dólares a un tipo decambio de 7.8.

### d)Parejas de clientes con el mismo crédito que no sean ellos mismos y que no haya parejas duplicadas

### e)Clientes que han comprado en MAJADAS y no en VH

### f)Todas las tiendas que tengan otras tiendas en la misma dirección

### g)Clientes con los créditos más altos (sin utilizar MAX())

### h)Clientes cuyo crédito en dólaressea mayor a 1 

### i)Personas que no han hecho ninguna compra

### j)Diferencia entre el promedio de crédito de los clientes de MAJADAS y de VH

### k)Número de clientes de cada tienda, de las que tienen compras, ordenado por nombre de tienda.

### l)Cree un trigger que considere apropiado para este esquema. Justifique su elección (5)

### m)Genere un reporte (vista) que muestre información de ventas a ser utilizado por los gerentes de la tienda.  El diseño (columnas y filtros) debe de ser justificado. (5)

### a)Implemente el modelo relacional en SQLite. La base de datos debe de poseer datos de prueba y será utilizada por medio de Jupyter Notebooks (10) Genere consulta SQL para generar / resolver

In [ ]:
%load_ext sql

Crear DB

In [ ]:
%sql sqlite:///dbtrue2.db

###  Tabla Cliente GT

In [ ]:
%%sql CREATE TABLE Cliente (
    cliente_id INTEGER PRIMARY KEY, 
    nit VARCHAR(150), 
    nombre VARCHAR(150),
    credito INTEGER)

In [ ]:
import random
nombres = [ 'Jorge', 'Jenny', 'Aletse', 'Daniela', 'Yaneth', 'Juan', 'Josepino', 'Bidkar', 'Magda']
apellidos = [ 'Xetumul', 'Escobar', 'Kej', 'Martinez', 'Botran', 'Salmeri', 'Sartor', 'Melgar','Moscoso']
id = 0
for i in range(1000):
    id = i
    name = random.randint(0, len(nombres)-1)
    clienteid = name
    ape = random.randint(0, len(apellidos)-1)
    metal = (nombres[name] + ' ' + apellidos[ape])
    nombreid = random.randint(0, len(metal)-1)
    credito = round(random.uniform(100, 2000), 30)
    nitid= random.randint(10000000,99999999)
    


    
    %sql INSERT INTO Cliente VALUES ( :id, :nitid, :metal, :credito);

###  Tabla Tienda GT

In [ ]:
%%sql CREATE TABLE Tienda (
    tienda_id INTEGER PRIMARY KEY, 
    nombre VARCHAR(150), 
    direccion VARCHAR(150))

In [ ]:
import random
Tiendas = ['La FM Zacapa', 'Mega Plaza ', 'Majadas', 'VH', 'El Duende', 'El Salama' , 'Chile Cobanero', 'Humo En Tus Ojos']
direcciones= ['ZONA 1' , 'ZONA 2', 'ZONA 15', 'ZONA 16', 'ZONA 18', 'ZONA 12', 'GUALAN', 'LA UNION', 'PAJAPITA', 'COATEPEQUE','SOLOLA']

id = 0
for i in range(1000):
    id = i
    a = id
    dire= random.randint(0, len(direcciones)-1)
    full = (direcciones[dire] )
    
    tiendaid = random.randint(0, len(Tiendas)-1)
    
    
  
   
    
   
    
    %sql INSERT INTO Tienda VALUES ( :id, :a, :full);

In [ ]:
%sql SELECT * FROM Tienda Limit 10;

###  Tabla Compras Compras GT

In [ ]:
%%sql CREATE TABLE Compra (
    compras_id INTEGER PRIMARY KEY, 
    cliente_id INTEGER VARCHAR(50), 
    tienda_id VARCHAR(150),
    total INTEGER,
    fecha DATE,
    FOREIGN KEY (cliente_id) REFERENCES Cliente(id),
    FOREIGN KEY (tienda_id) REFERENCES Tienda(id))

In [ ]:

    
    
import random
Tiendas = ['La FM Zacapa', 'Mega Plaza ', 'Majadas', 'VH', 'El Duende', 'El Salama' , 'Chile Cobanero', 'Humo En Tus Ojos']
direcciones= ['ZONA 1' , 'ZONA 2', 'ZONA 15', 'ZONA 16', 'ZONA 18', 'ZONA 12', 'GUALAN', 'LA UNION', 'PAJAPITA']
id = 0
for i in range(1000):
    id = i
    name = random.randint(0, len(nombres)-1)
    clienteid = name
    ape = random.randint(0, len(apellidos)-1)
    full = (nombres[name] + ' ' + apellidos[ape])
    tiendaid = random.randint(0, len(Tiendas)-1)
    total = round(random.uniform(100, 2000), 2)
    
    print(tiendaid)
    
    #esta parte ayuda a que se pueda ingresar la fecha a los comspras 
    day = random.randint(1, 30)
    month = random.randint(1, 12)
    year = random.randint(2006, 2019)
    date = (str(day)+'/'+str(month)+'/'+str(year))
    
    %sql INSERT INTO Compra VALUES ( :id, :clienteid, :tiendaid, :total, :date);

   ### b)Nombres y créditos de clientes de los compradores de MAJADAS ordenado por crédito descendente y nombre ascendente.

In [72]:
%%sql select credito, nombre from Cliente
inner join Compra ON Cliente.cliente_id= Compra.cliente_id
where Compra.tienda_id=5 
ORDER BY credito DESC, nombre ASC

Limit 20;

 * sqlite:///dbtrue2.db
Done.

[(1900.9177627049303, 'Magda Xetumul'),
 (1900.9177627049303, 'Magda Xetumul'),
 (1900.9177627049303, 'Magda Xetumul'),
 (1900.9177627049303, 'Magda Xetumul'),
 (1900.9177627049303, 'Magda Xetumul'),
 (1900.9177627049303, 'Magda Xetumul'),
 (1900.9177627049303, 'Magda Xetumul'),
 (1900.9177627049303, 'Magda Xetumul'),
 (1900.9177627049303, 'Magda Xetumul'),
 (1900.9177627049303, 'Magda Xetumul'),
 (1900.9177627049303, 'Magda Xetumul'),
 (1885.0788442080886, 'Daniela Botran'),
 (1885.0788442080886, 'Daniela Botran'),
 (1885.0788442080886, 'Daniela Botran'),
 (1885.0788442080886, 'Daniela Botran'),
 (1885.0788442080886, 'Daniela Botran'),
 (1885.0788442080886, 'Daniela Botran'),
 (1885.0788442080886, 'Daniela Botran'),
 (1885.0788442080886, 'Daniela Botran'),
 (1885.0788442080886, 'Daniela Botran')]

### c)Agregar en el resultado anterior el crédito en dólares a un tipo decambio de 7.8.

In [73]:
%%sql select (credito/7.8) as creditodolares, nombre from Cliente
inner join Compra ON Cliente.cliente_id= Compra.cliente_id
where Compra.tienda_id=5
ORDER BY credito DESC, nombre ASC
Limit 15;

 * sqlite:///dbtrue2.db
Done.

[(243.70740547499108, 'Magda Xetumul'),
 (243.70740547499108, 'Magda Xetumul'),
 (243.70740547499108, 'Magda Xetumul'),
 (243.70740547499108, 'Magda Xetumul'),
 (243.70740547499108, 'Magda Xetumul'),
 (243.70740547499108, 'Magda Xetumul'),
 (243.70740547499108, 'Magda Xetumul'),
 (243.70740547499108, 'Magda Xetumul'),
 (243.70740547499108, 'Magda Xetumul'),
 (243.70740547499108, 'Magda Xetumul'),
 (243.70740547499108, 'Magda Xetumul'),
 (241.6767748984729, 'Daniela Botran'),
 (241.6767748984729, 'Daniela Botran'),
 (241.6767748984729, 'Daniela Botran'),
 (241.6767748984729, 'Daniela Botran')]

### d)Parejas de clientes con el mismo crédito que no sean ellos mismos y que no haya parejas duplicadas

In [ ]:
%sql INSERT INTO Cliente(cliente_id,nit,nombre,credito) VALUES(4175757237,41277588654,'Solagne',100.40871531636516);

In [74]:
%%sql Select * from Cliente
where credito IN
(Select credito
From Cliente
Group by credito
having Count(credito) > 0
)
Order by credito
limit 4;

 * sqlite:///dbtrue2.db
Done.

[(73, '33939941', 'Jenny Moscoso', 100.40871531636516),
 (4175757237, '41277588654', 'Solagne', 100.40871531636516),
 (457574717, '474715727527527', 'AMOR Escobar', 100.8489430956789),
 (4123131237, '4123123124214', 'Clementino', 100.8489430956789)]

In [ ]:
### e)Clientes que han comprado en MAJADAS y no en VH
%%sql select credito, nombre from Cliente
inner join Compra ON Cliente.cliente_id= Compra.cliente_id
where Compra.tienda_id=5  Compra.tienda_id!=6
ORDER BY credito DESC, nombre ASC;

### f

In [ ]:
##f)Todas las tiendas que tengan otras tiendas en la misma dirección


%sql INSERT INTO Tienda(tienda_id, nombre,direccion) VALUES(7254480,1,'ZONA 18');

### f)Todas las tiendas que tengan otras tiendas en la misma dirección¶

In [75]:
%%sql select *from Tienda 
WHERE direccion = 'ZONA 18' AND nombre= 1

 * sqlite:///dbtrue2.db
Done.

[(1, '1', 'ZONA 18'), (7254480, '1', 'ZONA 18')]

### g)Clientes con los créditos más altos (sin utilizar MAX())

In [76]:
%%sql Select credito, nombre
from Cliente
order by credito desc
Limit 5;

 * sqlite:///dbtrue2.db
Done.

[(1998.115867242114, 'Jenny Botran'),
 (1993.588848874314, 'Bidkar Escobar'),
 (1992.384531298371, 'Aletse Martinez'),
 (1990.9146490967873, 'Magda Kej'),
 (1989.8455278845693, 'Juan Martinez')]

### h)

In [77]:
%%sql Select (credito/7.8) as Credollar, nombre
from Cliente
where Credollar > 1
Limit 5;

 * sqlite:///dbtrue2.db
Done.

[(65.34524623247418, 'Magda Melgar'),
 (241.6767748984729, 'Daniela Botran'),
 (162.55018612137428, 'Jenny Melgar'),
 (177.22524026861484, 'Jorge Martinez'),
 (212.5310717063369, 'Jenny Moscoso')]

In [ ]:
#i)Personas que no han hecho ninguna compra

#%sql Select * from Cliente Limit 10;

%sql INSERT INTO Cliente(cliente_id, nit, nombre, credito) Values( 7071996, 77777777777777777, 'Edward Elric', Null);

%sql Insert into Compra(compras_id,cliente_id,tienda_id,total,fecha) Values(777777777, 777777777777777, 888888888888888, 0, null);

In [78]:
%%sql Select credito,nombre, Compra.compras_id, Compra.cliente_id, total from Cliente, Compra
 WHERE total= 0
    Limit 10;

 * sqlite:///dbtrue2.db
Done.

[(509.6929206132986, 'Magda Melgar', 777777777, 777777777777777, 0),
 (1885.0788442080886, 'Daniela Botran', 777777777, 777777777777777, 0),
 (1267.8914517467194, 'Jenny Melgar', 777777777, 777777777777777, 0),
 (1382.3568740951957, 'Jorge Martinez', 777777777, 777777777777777, 0),
 (1657.7423593094277, 'Jenny Moscoso', 777777777, 777777777777777, 0),
 (1263.0578421425114, 'Jorge Moscoso', 777777777, 777777777777777, 0),
 (1853.3449844252973, 'Jenny Kej', 777777777, 777777777777777, 0),
 (1900.9177627049303, 'Magda Xetumul', 777777777, 777777777777777, 0),
 (573.841545478766, 'Bidkar Martinez', 777777777, 777777777777777, 0),
 (1832.1523846663622, 'Juan Botran', 777777777, 777777777777777, 0)]

### Nmero de clientes de cada tienda, de las que tienen compras, ordenado por nombre de tienda

In [79]:
%%sql SELECT tienda_id, cliente_id,count(*),total
from Compra
where total > 0
Group by tienda_id
Limit 20;

 * sqlite:///dbtrue2.db
Done.

[('0', 5, 124, 289.36),
 ('1', 2, 112, 1257.95),
 ('2', 6, 125, 1699.65),
 ('3', 2, 143, 821.27),
 ('4', 3, 133, 1592.83),
 ('5', 4, 112, 421.4),
 ('6', 6, 118, 113.15),
 ('7', 4, 133, 1336.15)]

In [ ]:
###  l)Cree un trigger que considere apropiado para este esquema. Justifique su elección (5)

%%sql CREATE TRIGGER MAYUSNOMBRE
    ON Cliente
    AFTER INSERT, UPDATE
AS
BEGIN

    UPDATE Cliente
    SET nombre= Upper(nombre)
    where cliente_id IN(SELECT cliente_id FROM Cliente)
end;